app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("tittle", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["tittle", "New roll-on"], ["body", "last for 24hrs sta fresh"], ["created_at", "2023-12-08 09:01:28.377589"], ["updated_at", "2023-12-08 09:01:28.377589"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "last for 24hrs stay fresh"], ["updated_at", "2023-12-08 09:01:39.343108"], ["id", 1]]